from summarizer import Summarizer
from transformers import AutoTokenizer, AutoModel
from rouge import Rouge


body='''
أعلن اليوم الخميس في ماليزيا عن دخول ملك البلاد في حجر صحي بعد إصابة 7 عاملين في القصر بفيروس كورونا، ليكون بذلك أحدث زعماء العالم التحاقا بقائمة القادة الذين تحوم حولهم شبهة الإصابة بهذا الفيروس.
وقال مشرف القصر الوطني في ماليزيا أحمد فاضل شمس الدين اليوم إن الملك السلطان عبد الله رعاية الدين المصطفى بالله شاه والملكة الحاجة عزيزة أمينة ميمونة الإسكندرية قد خضعا لفحص طبي واختبار تشخيصي للفيروس، حيث جاءت نتائج تحاليلهما سلبية.
وقال إن الملك والملكة يخضعان حاليا للحجر الصحي في القصر، ولن يقبلا أي زيارة أو مقابلة رسمية إلى أن تنتهي فترة الحجر الصحي التي بدأت أمس ومن المقرر أن تستمر لمدة 14 يوما.
ويوم أمس الأربعاء، أعلن مقر إقامة ولي العهد البريطاني الأمير تشارلز إصابة الأمير بفيروس كورونا.
وقال متحدث باسم مقر إقامة الأمير تشارلز ثبتت إصابة الأمير تشارلز بفيروس كورونا، لقد ظهرت عليه أعراض طفيفة لكن صحته جيدة، وكان يعمل من البيت طوال الأيام الماضية كالمعتاد.
ومساء الأحد الماضي، أعلن في ألمانيا عن الاشتباه في إصابة المستشارة الألمانية أنجيلا ميركل بفيروس، وخضوعها لحجر منزلي رغم أن نتائج الفحوص التي أجرتها كانت سلبية، ومع ذلك قررت الخضوع للحجر الصحي والبقاء في المنزل.
في دوائر السلطة وقصور الحكم وخلال الأسابيع الماضية ومع اتساع دائرة العدوى وعدد الإصابات بفيروس كورونا في عدة دول ومناطق عبر العالم، بدأ الفيروس تدريجيا يقترب من مراكز اتخاذ القرار، وربما يعرض حياة قادة ومسؤولين كبار للخطر.
وخضع الرئيس الأميركي دونالد ترامب لفحص تأكد بعده أنه غير مصاب، وذلك بعد لقائه بوفد برازيلي أحد أفراده مصاب بالفيروس.
ولاحقا، أعلنت السلطات البرازيلية أن الوزير الذي التقى ترامب مصاب بالفيروس، كما وضع الرئيس جايير بولسونارو تحت المراقبة الصحية للتأكد من عدم إصابته.
وذكرت وسائل إعلام برازيلية اليوم أن سكرتير الرئيس أيضا مصاب بكورونا ووضع في الحجر الصحي.
كما خضع مايك بنس نائب الرئيس الأميركي وزوجته للفحص بعد إصابة موظف في مكتبه بالفيروس.
وخلال الأسابيع الماضية أعلنت السلطات النرويجية أن الملك هارالد الخامس والملكة وكامل أعضاء الحكومة وضعوا في الحجر الصحي بسبب الفيروس.
وفي كندا، قرر رئيس الوزراء جاستن ترودو العمل من منزله بعدما تبين أن زوجته صوفي غريغوار مصابة بالوباء.
وفي فرنسا، أصيب وزير الثقافة فرانك ريستر بفيروس كورونا، كما أصيب أيضا 10 نواب على الأقل، في حين تقرر نقل اجتماعات مجلس الوزراء من القاعة التي تعقد فيها تقليديا إلى أخرى أكبر مساحة لضمان ترتيب المقاعد على مسافة متر على الأقل.
كما أعلنت وزارة الدفاع الأميركية في وقت سابق أن الوزير مارك إسبر ونائبه وضعا في الحجر الصحي بعد تأكيد إصابة عشرات من طاقم الوزارة بفيروس كورونا.
وقبل ذلك، أعلن الجيش الأميركي أن قائده في أوروبا إلى جانب عدد من الموظفين ربما تعرضوا لفيروس كورونا خلال مؤتمر عقد في الآونة الأخيرة. كما أعلن قبل أيام مكتب السيناتور الأميركي الجمهوري راند بول أنه أصيب بكورونا المستجد، ليصبح بذلك أول عضو في مجلس الشيوخ تتأكد إصابته بالفيروس. 
وسبق لعضو مجلس الشيوخ الأميركي السيناتور تيد كروز أن أعلن عزل نفسه بعدما التقى شخصا ثبتت إصابته بالفيروس.
الاصابات الأكبر في إيران، أصاب الفيروس عددا من المسؤولين، وأدى في بداية الشهر الجاري إلى وفاة عضو مجلس تشخيص مصلحة النظام محمد مير محمدي.
كما أصيب بالوباء علي أكبر ولايتي مستشار المرشد الإيراني، ومعصومة ابتكار نائبة الرئيس الإيراني لشؤون المرأة، وإيرج حريرجي نائب وزير الصحة الإيراني الذي ظهر أمس الجمعة في مؤتمر صحفي عقب تعافيه من المرض.
وفي أستراليا، نقل وزير الداخلية بيتر دوتون إلى المستشفى بعدما ثبتت إصابته بفيروس كورونا، بينما أعلن في إندونيسيا أن وزير النقل بودي كاريا سومادي نقل إلى المستشفى عقب إصابته بالفيروس.
وزراء بوركينا فاسو ولئن كان الفيروس استهدف قادة عدد من الدول ومسؤوليها بشكل فردي غالبا، فقد اختلف الحال في دولة بوركينا فاسو، إذ أصاب عددا من وزرائها بشكل متزامن، ويخشى أن يشل حكومتها إذا تكشفت إصابات جديدة.
وقالت صحيفة لوموند الفرنسية إن بوركينا فاسو هي البلد الأكثر تضررا بوباء كورونا (كوفيد-19) حتى الآن في غربي أفريقيا، حيث توفيت النائبة الثانية لرئيس البرلمان وأصيب خمسة وزراء، إلى جانب الحديث عن إصابة كل من السفير الإيطالي والأميركي، مما أثار غضبا على شبكات التواصل الاجتماعي بسبب ما اعتبر "تراخي" الحكومة في إدارة الوباء.
وقالت الصحيفة في مقال بقلم صوفي دوس مراسلتها في العاصمة واغادوغو إن الأمر اعتبر في البداية أنباء كاذبة، قبل أن يؤكده أصحاب الشأن أنفسهم، فقد أعلن وزير التعليم ستانيسلاس أوارو على فيسبوك إصابته يوم 19 مارس الجاري، قائلا عقب التشخيص ظهر أنني إيجابي بالنسبة لفيروس كورونا، وفي اليوم التالي أعلن نظيراه في الإدارة الإقليمية والمعادن إصابتهما بكورونا.
 ولم يتأخر وزير الشؤون الخارجية ألفا باري كثيرا بعدهم، حيث قال بعد يومين فقط من نفي الإشاعة رسميا إنه مصاب بالفيروس لقد تحققت الشائعات، تلقيت للتو اختبارا إيجابيا لكوفيد-19.
وفي 23 مارس الحالي جاء دور وزير التجارة هارونا كابوري ليعلن إصابته هو الآخر، ليكون خامس الوزراء الذين تأكدت إصابتهم من أصل 29 عضوا في حكومة بوركينا فاسو، كما تقول المراسلة، مشيرة كذلك إلى إصابة كل من السفير الإيطالي والأميركي في هذا البلد بكورونا المستجد.
'''

summary_evaluation = '''
أعلن اليوم الخميس في ماليزيا عن دخول ملك البلاد في حجر صحي بعد إصابة 7 عاملين في القصر بفيروس كورونا، ليكون بذلك أحدث زعماء العالم التحاقا بقائمة القادة الذين تحوم حولهم شبهة الإصابة بهذا الفيروس.
ويوم أمس الأربعاء، أعلن مقر إقامة ولي العهد البريطاني الأمير تشارلز إصابة الأمير بفيروس كورونا.
ومساء الأحد الماضي، أعلن في ألمانيا عن الاشتباه في إصابة المستشارة الألمانية أنجيلا ميركل بفيروس، وخضوعها لحجر منزلي رغم أن نتائج الفحوص التي أجرتها كانت سلبية، ومع ذلك قررت الخضوع للحجر الصحي والبقاء في المنزل.
في دوائر السلطة وقصور الحكم وخلال الأسابيع الماضية ومع اتساع دائرة العدوى وعدد الإصابات بفيروس كورونا في عدة دول ومناطق عبر العالم، بدأ الفيروس تدريجيا يقترب من مراكز اتخاذ القرار، وربما يعرض حياة قادة ومسؤولين كبار للخطر.
ولاحقا، أعلنت السلطات البرازيلية أن الوزير الذي التقى ترامب مصاب بالفيروس، كما وضع الرئيس جايير بولسونارو تحت المراقبة الصحية للتأكد من عدم إصابته.
وخضع الرئيس الأميركي دونالد ترامب لفحص تأكد بعده أنه غير مصاب، وذلك بعد لقائه بوفد برازيلي أحد أفراده مصاب بالفيروس.
وخلال الأسابيع الماضية أعلنت السلطات النرويجية أن الملك هارالد الخامس والملكة وكامل أعضاء الحكومة وضعوا في الحجر الصحي بسبب الفيروس.
وفي كندا، قرر رئيس الوزراء جاستن ترودو العمل من منزله بعدما تبين أن زوجته صوفي غريغوار مصابة بالوباء.
وفي فرنسا، أصيب وزير الثقافة فرانك ريستر بفيروس كورونا، كما أصيب أيضا 10 نواب على الأقل، في حين تقرر نقل اجتماعات مجلس الوزراء من القاعة التي تعقد فيها تقليديا إلى أخرى أكبر مساحة لضمان ترتيب المقاعد على مسافة متر على الأقل.
كما أعلنت وزارة الدفاع الأميركية في وقت سابق أن الوزير مارك إسبر ونائبه وضعا في الحجر الصحي بعد تأكيد إصابة عشرات من طاقم الوزارة بفيروس كورونا.
الاصابات الأكبر في إيران، أصاب الفيروس عددا من المسؤولين، وأدى في بداية الشهر الجاري إلى وفاة عضو مجلس تشخيص مصلحة النظام محمد مير محمدي.
وزراء بوركينا فاسو ولئن كان الفيروس استهدف قادة عدد من الدول ومسؤوليها بشكل فردي غالبا، فقد اختلف الحال في دولة بوركينا فاسو، إذ أصاب عددا من وزرائها بشكل متزامن، ويخشى أن يشل حكومتها إذا تكشفت إصابات جديدة.
وقالت صحيفة لوموند الفرنسية إن بوركينا فاسو هي البلد الأكثر تضررا بوباء كورونا (كوفيد-19) حتى الآن في غربي أفريقيا، حيث توفيت النائبة الثانية لرئيس البرلمان وأصيب خمسة وزراء، إلى جانب الحديث عن إصابة كل من السفير الإيطالي والأميركي، مما أثار غضبا على شبكات التواصل الاجتماعي بسبب ما اعتبر "تراخي" الحكومة في إدارة الوباء.
ولم يتأخر وزير الشؤون الخارجية ألفا باري كثيرا بعدهم، حيث قال بعد يومين فقط من نفي الإشاعة رسميا إنه مصاب بالفيروس لقد تحققت الشائعات، تلقيت للتو اختبارا إيجابيا لكوفيد-19.
'''

albert_model = AutoModel.from_pretrained('asafaya/bert-base-arabic')
albert_tokenizer = AutoTokenizer.from_pretrained('asafaya/bert-base-arabic')

modelSummarizer = Summarizer(custom_model=albert_model, custom_tokenizer=albert_tokenizer)
result = modelSummarizer(body)
generated_summary = ''.join(result)
print(generated_summary)

rouge = Rouge()
scores = rouge.get_scores(generated_summary, summary_evaluation)

print(scores)

